computer-networking-a-topdown-approach.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2020-03-04 Wed 15:49 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>理解计算机网络</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Kinney Zhang">
<link rel="stylesheet" type="text/css" href="https://blog.geekinney.com/static/light.css"/>
</head>
<body>
<div id="content">
<header>
<h1 class="title">理解计算机网络</h1>
</header><div class="post-info"><p>「 分类:网络 / 日期:2020-03-02 / 字数:1920 」</p></div>

<nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org2935cbd">1. 计算机网络和因特网</a>
<ul>
<li><a href="#orge01899a">1.1. 什么是英特网</a></li>
<li><a href="#orgb327a65">1.2. 网络边缘</a></li>
<li><a href="#orgf5f16bd">1.3. 网络核心</a></li>
</ul>
</li>
</ul>
</div>
</nav>

<p>
用自己的理解来解释计算机网络的基本理论，参考书籍《计算机网络：自顶向下方法》第六版。
</p>

<div id="outline-container-org2935cbd" class="outline-2">
<h2 id="org2935cbd"><span class="section-number-2">1</span> 计算机网络和因特网</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orge01899a" class="outline-3">
<h3 id="orge01899a"><span class="section-number-3">1.1</span> 什么是英特网</h3>
<div class="outline-text-3" id="text-1-1">
<p>
<b>构成描述：</b>
</p>

<p>
英特网是一个世界范围的计算机网络，它连接了世界上数以亿计的计算设备。这些设备被称为主机或端系统。其中端系统通过 <span class="underline">通信链路</span> (communication link) 和 <span class="underline">分组交换机</span> (package switch) 连接在一起。通信链路和分组交换机统称为网络的路径(route)。
</p>

<p>
<code>通信链路</code> 有不同类型的物理媒介，包括同轴电缆、铜线、光纤和无线电频谱 。不同媒介有不同的传输速率，用比特/秒度量(bit/s或bps)。通信链路的作用是 <span class="underline">传输分组数据</span> 。
</p>

<p>
主要的 <code>分组交换机</code> 有 路由器 和 链路层交换机 。分组交换机的作用是 <span class="underline">使分组数据朝着目的地转发</span> 。
</p>

<p>
<b>服务描述：</b>
</p>

<p>
英特网向应用程序提供了多种服务，应用程序一般选择其中一种向终端用户提供服务，比如电子邮件、web冲浪、即时通讯等。这些程序因为涉及到多终端间的数据交换，被称为分布式应用程序。应用程序 <span class="underline">不关心网络内部的数据传输及分组交换的细节</span> 。它关心的是如何使用英特网服务实现终端间的数据交换。这种应用程序必须遵守的发送和接收数据的标准就是 <code>应用程序编程接口</code> (API)。
</p>

<p>
<b>协议：</b>
</p>

<p>
<span class="underline">协议定义了在两个或多个通信实体间交换的报文格式和次序，以及报文发送和/或接收一条报文或其它事件所采取的动作。</span>
</p>
</div>
</div>

<div id="outline-container-orgb327a65" class="outline-3">
<h3 id="orgb327a65"><span class="section-number-3">1.2</span> 网络边缘</h3>
<div class="outline-text-3" id="text-1-2">
<p>
<b>接入网：</b>
</p>

<p>
家庭接入：DSL、电缆、FTTH、拨号和卫星 / 企业(和家庭)接入：以太网和WiFi / 广域无线接入：3G和LTE
</p>

<p>
<b>物理媒介：</b>
</p>

<p>
双绞铜线、同轴电缆、光纤、陆地无线电信道、卫星无线电信道
</p>
</div>
</div>

<div id="outline-container-orgf5f16bd" class="outline-3">
<h3 id="orgf5f16bd"><span class="section-number-3">1.3</span> 网络核心</h3>
<div class="outline-text-3" id="text-1-3">
<p>
网络核心是由端系统的分组交换机和通信链路构成的网状网络。
</p>

<p>
<b>分组交换：</b>
</p>

<p>
交换机在向输出链路传输一个分组前必须接收到整个分组。这就是交换机的 <span class="underline">存储转发机制</span> 。该机制导致了 <span class="underline">存储转发时延</span> 。
</p>

<p>
分组交换机与多条链路相连，每条链路都有一个输出缓存。当某条输出链路正在工作时，同条链路到达的分组就要排队，产生 <span class="underline">排队时延</span> 。当缓存占满时，继续到达的分组就会丢失，称为 <span class="underline">丢包</span> 。
</p>

<p>
源端在数据分组时会在每个分组的首部包含目的地的IP地址。分组达到路由器后，路由器根据ip地址搜索其 <span class="underline">转发表</span> ， <span class="underline">转发表记录了目的地址和输出链路的映射</span> ，路由器据此将分组导向合适的输出链路。
</p>

<p>
至于，路由器的转发表是如何生成的，路由器如何选择路由最佳路径，这些都由 <span class="underline">路由选择协议</span> 决定。
</p>

<p>
<b>电路交换：</b>
</p>

<p>
电路交换原理：
</p>

<p>
分组交换与电路交换对比：
</p>

<p>
<b>网络的网络：</b>
</p>

<p>
今天的英特网是一个网络的网络，由十多个第一层ISP和若干不同层次的区域ISP组成。普通用户作为接入ISP向与其相连的区域IPS付费，底层次ISP向较高层次ISP付费，形成了庞大的 <span class="underline">层次结构</span> 。除了以上的层次结构，客户ISP付费可以通过 <span class="underline">存在点(PoP)</span> 与提供商ISP直接连接，以获取高速链路；相同层次的邻近ISP可以 <span class="underline">对等(peer)</span> ，对等网络间不结算流量费用；第三方公司可以创建 <span class="underline">网络交换点(IXP)</span> ， 多个ISP在IXP中共同对等。特别地，如今的 <span class="underline">内容提供商(如谷歌)</span> 一般拥有专用网络，这种专用网络可以绕过高层ISP，与低层ISP对等或直接与接入ISP相连。以上就是如今的因特网的大概样貌。
</p>

<p>
<b>分组交换中的时延、丢包和吞吐量：</b>
</p>

<ul class="org-ul">
<li>处理时延：检查分组首部和决定将该分组导向何处所需要的时间，还包括检查比特级别的差错的时间。</li>
<li>排队时延：分组在链路上等待传输时排队的时间。</li>
<li>传输时延：将分组的所有比特推到链路所需的时间，受传输速率影响。</li>
<li>传播时延：分组从链路起点到另一台路由器传播所需的时间，受传播速率影响，传播速率取决于链路的物理媒介。</li>
</ul>

<p>
以上四种时延加一起来叫做 <span class="underline">节点总时延</span> 。传输时延和传播时延比较 ：传输时延是将是将分组推出到链路的时间，是分组长度和传输速率的函数，与路由器间距离无关。传播时延是一个比特从一台路由器到另一台路由器传播用的时间，是路由器间距离的函数，与分组长度和链路传输速率无关。
</p>

<p>
<span class="underline">四种时延中，排队时延是最复杂和有趣的情况</span> ，因此有大量的论文和专著研究它。接下来根据自己的理解阐述排队时延的相关问题：
</p>

<p>
<i>首先，我们应该承认这样的事实：当比特到达队列的速率大于从队列推出比特的速率时，一定会产生排队。当比特到达队列的速率小于从队列推出比特的速率时，也不一定不会产生排队，因为多个分组可能同时到达。接下来，用数值计算来量化这一过程。</i>
</p>

<p>
<i>我们用a(单位:分组/秒)表示分组到达队列的平均速率。用R(单位:b/s)表示从队列推出比特的速率，也就是传输速率。假设每个分组都是由L比特组成的，那么比特到达队列的平均速率为 La bps 。我们将两种速率的比值 La/R 称为 <span class="underline">流量强度</span> 。我们用它来表征时延的统计量。</i>
</p>

<p>
<i>当 <code>La/R &gt; 1</code> 时，排队将无限增加，排队时延趋于无穷大。这和堵车是一个道理，发车的速率小于车到达的速率，车队就会越堵越长。</i>
</p>

<p>
<i>当 <code>La/R ≤ 1</code> 时，此时分组到达的时间间隔将影响排队情况。假设每 L/R 秒到达一个分组，则不会排队；假设每 (L/R)/N 秒到达N个分组，则第一个分组不用排队，后面分组都要排队且排队时延为 (n-1)L/R 。</i>
</p>

<p>
<i>实际情况是，达到队列的过程是随机，不存在周期性。此时 La/R 不能全面表征时延的统计量。此时考虑 <code>La/R = 0</code> 时，平均排队时延接近0； <code>La / R接近1时</code> 平均排队时延趋于无穷大。据此，不难画出流量强度与平均排队时延的关系图。形状类似一个从接近原点处开始的斜率不断增大的弧线，接近1时的斜率趋于正无穷。</i>
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Kinney Zhang (<a href="mailto:kinneyzhang666@gmail.com">kinneyzhang666@gmail.com</a>)</p>
<p class="date">Date: 2020-03-02</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 26.3 (<a href="https://orgmode.org">Org</a> mode 9.1.9)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
